Revit 2027 API
ParameterTypeId.RebarHookLineLenFactor Property
 "Extension Multiplier"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarHookLineLenFactor { get; }
Public Shared ReadOnly Property RebarHookLineLenFactor As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarHookLineLenFactor {
	ForgeTypeId^ get ();
}
static member RebarHookLineLenFactor : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace